Введение в сетевое администрирование:  
 
СРО: Настройте локальную сеть на двух виртуальных машинах с помощью статической и динамической IP-адресации. Настройте базовый файервол на уровне iptables и обеспечьте маршрутизацию трафика.  
 
СРОП: Проведите настройку и тестирование сетевого соединения между несколькими виртуальными машинами через VirtualBox или VMware, используя VLAN. Представьте отчет с анализом конфигураций и результатами сетевых проверок (ping, traceroute).

1. Введение

В данной работе была проведена настройка локальной сети на двух виртуальных машинах с использованием статической и динамической IP-адресации, а также настройка базового файервола на уровне iptables для маршрутизации трафика.
2. Настройка локальной сети (СРО)
2.1. Настройка виртуальных машин

    Создание виртуальных машин:
        Созданы две виртуальные машины в VirtualBox:
            VM1 (Ubuntu Server 22.04)
            VM2 (Ubuntu Server 22.04)

    Настройка сети:
        Для обеих виртуальных машин настроен сетевой адаптер в режим "Сетевой мост" или "Внутренняя сеть" в зависимости от необходимости.

2.2. Настройка IP-адресации

Статическая IP-адресация для VM1:

```console
stacy@stacy-VirtualBox:~$ sudo nano /etc/netplan/01-netcfg.yaml
stacy@stacy-VirtualBox:~$ sudo netplan apply
```
Конфигурация:

```console
network:
  version: 2
  renderer: networkd
  ethernets:
    enp0s3:
      dhcp4: false
      addresses:
        - 192.168.1.10/24
      gateway4: 192.168.1.1
      nameservers:
        addresses:
          - 8.8.8.8
          - 8.8.4.4
```

```console
stacy@stacy-VirtualBox:~$ ip route
default via 192.168.1.1 dev enp0s3 proto static metric 100 
169.254.0.0/16 dev enp0s3 scope link metric 1000 
192.168.1.0/24 dev enp0s3 proto kernel scope link src 192.168.1.10 metric 100
```
